def 加法(x, y):
    return x + y
def 減法(x, y):
    return x - y
def 乘法(x, y):
    return x * y
def 除法(x, y):
    商數 = x // y
    餘數 = x % y
    return 商數, 餘數
print("歡迎使用計算機")
while True:
    計算類型 = input("請輸入計算類型(1)加法(2)減法(3)乘法(4)除法(按任意鍵退出)：")
    if 計算類型 in ("1", "2", "3", "4"):
        數字1 = int(input("請輸入第一個數："))
        數字2 = int(input("請輸入第二個數："))
        if 計算類型 == "1":
            print(f"{數字1} 加 {數字2} 等於 {加法(數字1, 數字2)}")
        elif 計算類型 == "2":
            print(f"{數字1} 減 {數字2} 等於 {減法(數字1, 數字2)}")
        elif 計算類型 == "3":
            print(f"{數字1} 乘 {數字2} 等於 {乘法(數字1, 數字2)}")
        elif 計算類型 == "4":
            if 數字1 % 數字2 == 0:
                print(f"{數字1} 除以 {數字2} 等於 {除法(數字1, 數字2)[0]}")
            else:
                print(f"{數字1} 除以 {數字2} 等於 {除法(數字1, 數字2)[0]} 餘 {除法(數字1, 數字2)[1]}")
    else:
        print("拜拜~")
        break
